run/fsiFoam/beamInCrossFlow/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          256;
        startFace       41600;
    }
    outlet
    {
        type            patch;
        nFaces          256;
        startFace       41856;
    }
    top
    {
        type            wall;
        nFaces          928;
        startFace       42112;
    }
    bottom
    {
        type            wall;
        nFaces          896;
        startFace       43040;
    }
    left
    {
        type            wall;
        nFaces          928;
        startFace       43936;
    }
    symmetry
    {
        type            symmetryPlane;
        nFaces          896;
        startFace       44864;
    }
    interface
    {
        type            wall;
        nFaces          192;
        startFace       45760;
    }
)

// ************************************************************************* //
